In [1]:
import pandas as pd

In [3]:
ratings = pd.read_csv("ratings.csv")
movies = pd.read_csv("movies.csv")

In [4]:
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [5]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [17]:
# Task 1
merged = ratings.merge(movies, on="movieId", how="inner")
merged[merged['rating'] == 5.0]['title'].value_counts().head(1)

title
Shawshank Redemption, The (1994)    153
Name: count, dtype: int64

In [18]:
transactions = pd.read_csv("transactions.csv")
power = pd.read_csv("power.csv")

In [19]:
transactions.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [20]:
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [36]:
power[
    (power["year"].between(2005, 2010)) & 
    (power["category"].isin([4, 12, 21])) & 
    (power["country"].isin(["Latvia", "Lithuania", "Estonia"]))
].groupby("country")["quantity"].sum().reset_index()

     country  quantity
0    Estonia   63440.0
1     Latvia   54844.0
2  Lithuania  122197.0